# CutMarkSymbolSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CutMarkType..::..CutMarkSymbolSize Property
CutMarkType Class See Also
---
The size of the cut mark symbol.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double CutMarkSymbolSize { get; set; }
```

Visual Basic
---
```text
Public Property CutMarkSymbolSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CutMarkSymbolSize {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for cutMarkSymbolSize must be greater than 0 and no more than 30000 feet. |

# See Also
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace